{
  "siteName": "Grand Seiko",
  "lang": "en",
  "commonPath": "/src/jp-ja/special/gscollection202502-en/asset/partials",
  "imgPath": "./asset/img",
  "jsPath": "./asset/js",
  "cssPath": "./asset/css",
  "meta": {
    "title": "Grand Seiko Spring Fair",
    "description": "This spring, don’t miss the opportunity to purchase a Grand Seiko watch at the Ginza flagship store. A special collection will be held from Thursday, February 27th, to Monday, March 31st. In addition to new summer models and rare limited editions, special gift items limited to this occasion will be available with purchases.",
    "ogp": "https://www.grand-seiko.com/jp-ja/special/gscollection202502-en/asset/img/ogp.png",
    "ogpUrl": "https://www.grand-seiko.com/jp-ja/special/gscollection202502-en/index",
    "canonical": "https://www.grand-seiko.com/jp-ja/special/gscollection202502-en/index"
  },
  "slick": [
    "Heritage Collection SBGH343",
    "Elegance Collection STGK019",
    "Evolution 9 Collection SLGH017",
    "Elegance Collection STGK013",
    "Sport Collection SBGE307",
    "Heritage Collection STGF385",
    "Elegance Collection SBGX353",
    "Elegance Collection SBGA407"
  ],
  "OtherItem": [
    {
      "brandName": "Elegance Collection",
      "slick": 6,
      "productName": "STGK019",
      "productCatchphrase": "Elegantly sized and set with diamonds, a new Grand Seiko women’s mechanical watch in stainless steel.",
      "price": "￥1,375,000 (tax included)",
      "driveType": "Automatic with manual winding",
      "accuracy": "Approx. 50 hours",
      "material": "Stainless steel, diamonds",
      "caseDiameter": "Diameter 27.8mm",
      "releaseDate": "",
      "modalDescription": "With the new STGK019, elegant proportions and diamond adornment meet the practicality of stainless steel. At just 27.8mm in diameter, this new women’s model is sized for smaller wrists, but it still contains a high-quality Grand Seiko automatic movement, the 9S27.\n\nThe dial features a molded pattern reminiscent of a beautiful silk cloth, painted the light pink of a cherry blossom with a slight hint of red. With 45 diamonds set on the bezel and an additional eleven on the dial serving as hour markers, the new STGK019 is sure to sparkle on the wrist as you go about your day.\n\nThe exhibition case back is a window into the technical mastery of the watchmakers of the Grand Seiko Studio Shizukuishi, where this elegant women’s watch and other Grand Seiko mechanical timepieces are made.",
      "limitedQuantity": ""
    },
    {
      "brandName": "Elegance Collection",
      "slick": 4,
      "productName": "STGK013",
      "productCatchphrase": "The Elegance Collection for women traces its heritage all the way back to the 1967 classic known as 62GS.",
      "price": "￥1,551,000 (tax included)",
      "driveType": "Automatic with manual winding",
      "accuracy": "Approx. 50 hours",
      "material": "Stainless steel, diamonds",
      "caseDiameter": "Diameter 30.6mm",
      "releaseDate": "",
      "modalDescription": "The refinement of the case is most evident when seen from the side. The diamonds are perfectly aligned along the Zaratsu polished surface which has the perfect, distortion-free finish that only this handcraft technique can deliver. While soft to the touch, every edge is sharp to the eye and catches the light in a way that is in sparkling harmony with the line of diamonds.\n\nThe Elegance Collection for women traces its heritage all the way back to the 1967 classic known as 62GS. With its bezel-free construction, the new design combines the strong, distinctive look of Grand Seiko with a soft feel to the case. The lines of the case are apparently seamless and the surfaces distortion-free so that the watch has an organic feeling, as if it were hewn from nature itself.\n\nThanks to the slim profile and powerful performance of the new Caliber 9S27, new design possibilities have been created.\n\nTheir design respects the heritage that was born in 1967 with the classic 62GS with its bezel-free construction, sharply angled hands and markers and highly polished surfaces. The new design combines the strong, distinctive look of one of Grand Seiko’s seminal creations with a fresh, soft and feminine grace.",
      "limitedQuantity": ""
    },
    {
      "brandName": "Heritage Collection",
      "slick": 4,
      "productName": "STGF385",
      "productCatchphrase": "A refined quartz watch that elegantly displays the brilliance of snow on a dial framed by 44 diamonds",
      "price": "￥792,000 (tax included)",
      "driveType": "Quartz",
      "accuracy": "±10 seconds per year",
      "material": "Stainless steel, diamonds",
      "caseDiameter": "Diameter 28.9mm",
      "releaseDate": "",
      "modalDescription": "The pristine dial beautifully expresses the magnificent color of a snowy landscape in the Hotaka mountains, which can be seen from the Shinshu Watch Studio where this model is produced. This \"snowflake\" dial features a detailed pattern that exudes the aesthetic sense of Grand Seiko, portraying an unspoiled, windswept snowfield. The shimmering color of the blued steel seconds hand and the dazzling set of 44 diamonds on the bezel combine to produce a wide variety of visual expressions depending on the light. Easy to match with any style of dress, this model’s refined elegance is readily apparent.",
      "limitedQuantity": ""
    },
    {
      "brandName": "Heritage Collection",
      "slick": 5,
      "productName": "SBGH343",
      "productCatchphrase": "A 62GS model that expresses the vibrancy of new leaves growing on a cherry tree",
      "price": "￥1,056,000 (tax included)",
      "driveType": "Automatic with manual winding",
      "accuracy": "Approx. 55 hours",
      "material": "High-intensity titanium",
      "caseDiameter": "Diameter 38.0mm",
      "releaseDate": "",
      "modalDescription": "This elegant 38mm wristwatch is a modern interpretation of the celebrated 62GS, Grand Seiko’s first mechanical model to feature automatic winding. A masterpiece of design, it embodies the \"evolution of practicality\" that has been central to Grand Seiko since its inception. The light-green dial is inspired by the new leaves that bud on cherry trees around the end of spring. The dial’s color is meant to express the vibrancy of the fresh new leaves as sunlight penetrates their translucence in the spaces between the peach-colored cherry blossom petals.\n\nThe movement powering this watch is the Hi-Beat Caliber 9S85, which 10 beats per second to provide more stable precision by reducing variations in accuracy. With a diameter of 38 mm, the watch makes a classic impression on the wrist, and the case and bracelet have been crafted from high-intensity titanium, which is even more resistant to abrasions than regular titanium and designed to be a delight to wear.",
      "limitedQuantity": ""
    },
    {
      "brandName": "Evolution 9 Collection",
      "slick": 3,
      "productName": "SLGH017",
      "productCatchphrase": "The dial inspired by white birch forests at night.",
      "price": "￥1,463,000 (tax included)",
      "driveType": "Automatic with manual winding",
      "accuracy": "Approx. 80 hours",
      "material": "High-intensity titanium",
      "caseDiameter": "Diameter 40.0mm",
      "releaseDate": "",
      "modalDescription": "This Hi-Beat 36000 watch shares the same Evolution 9 design as the celebrated ‘White Birch’ SLGH005 but is presented with a black dial that captures the atmosphere of the white birch tree forests on the Hiraniwa Plateau at night. These forests cover some 400 hectares and are located near the studio in Shizukuishi where all Grand Seiko mechanical watches are crafted.\n\nIts powerful hands and grooved, prominent markers ensure perfect legibility. Its Zaratsu polished, distortion-free mirror finish and delicate hairline finish alternate to give the case a quiet and harmonious glow. The case has wide lugs and a low center of gravity that ensure that the watch sits easily and securely on the wrist.\n\nThis high-beat watch is powered by the revolutionary Caliber 9SA5, which offers a power reserve of 80 hours thanks to the high efficiency of Grand Seiko’s unique Dual Impulse Escapement and the high power generation of the twin barrels.",
      "limitedQuantity": ""
    },
    {
      "brandName": "Sport Collection",
      "slick": 5,
      "productName": "SBGE307",
      "productCatchphrase": "A Spring Drive GMT that conveys the majesty of the lion through its durable design",
      "price": "￥1,529,000 (tax included)",
      "driveType": "Spring Drive",
      "accuracy": "Approx. 72 hours(3 days)",
      "material": "High-intensity titanium",
      "caseDiameter": "Diameter 44.5mm",
      "releaseDate": "",
      "modalDescription": "From the time of its first watch in 1960, Grand Seiko has used the lion, the so-called \"king of beasts,\" as a powerful symbol. Embodying the dignity of the regal creature, with all of its imposing and fierce presence, this model’s strong appearance recalls the animal’s powerful forelimbs, claws, and mane.\n\nThe lugs, intended to evoke lion claws, have a bold and distinctive shape and appearance, and the case rests firmly yet comfortably on the wrist. The reddish-brown GMT hand quietly makes its presence known on the shining white dial. The watch has a high level of practicality befitting a sports model. This can be observed in the Lumibrite coating on the hands and indexes, which makes it easy to read at night, as well as the formidable water resistance of 20 bar.\n\nThe watch is powered by the highly precise Spring Drive Caliber 9R66 with GMT, delivering a precision of ±15 seconds per month (equivalent to ±1 second per day).",
      "limitedQuantity": ""
    },
    {
      "brandName": "Elegance Collection",
      "slick": 5,
      "productName": "SBGX353",
      "productCatchphrase": "Blue skies and driven snow",
      "price": "￥528,000 (tax included)",
      "driveType": "Quartz",
      "accuracy": "±10 seconds per year",
      "material": "Stainless steel",
      "caseDiameter": "Diameter 34.0mm",
      "releaseDate": "",
      "modalDescription": "Though it may be slim, small and minimalist in its design, this elegant quartz Grand Seiko watch exhibits in full the core values, precision, durability, ease of use and beauty, that are at the heart of Grand Seiko.Its advanced 9F quartz caliber delivers a high precision rate of 10 seconds per year. The long minute and seconds hands reach right to the minute track to ensure that the time can be read exactly. The indexes are five-faceted and diamond-cut so that they stand out clearly from the dial and the 12 o’clock marker is distinct in design so that, whatever the viewing angle, the time is easily read at a glance. Most striking of all, however, is the snow-inspired pattern of the pale blue dial. Made at the Shinshu Watch Studio, high in the mountains of central Japan, it has the texture and color of the snow that, for several months a year, is clearly visible to the Grand Seiko watchmakers who ply their many crafts there. The dial is clean, simple and has a quiet and serene beauty that somehow feels uniquely Japanese. ",
      "limitedQuantity": ""
    },
    {
      "brandName": "Elegance Collection",
      "slick": 7,
      "productName": "SBGA407",
      "productCatchphrase": "Blue skies and driven snow",
      "price": "￥836,000 (tax included)",
      "driveType": "Spring Drive",
      "accuracy": "Approx. 72 hours(3 days)",
      "material": "Stainless steel",
      "caseDiameter": "Diameter 40.2mm",
      "releaseDate": "",
      "modalDescription": "In the Shinshu area of Japan, winter has its own special beauty. During the Shōkan \"sekki\" or season, the lakes are covered with ice, the air is sharp and dry and the sky takes on a deep blue hue that colors the snow that covers the mountains.\n\nThe magic of Shinshu in Shōkan is captured in this dial, which has the rich texture of driven snow and a unique blue tone. Like every Spring Drive Grand Seiko watch, this \"Blue Snowflake\" reflects the landscape around the facility where it was created and reveals another aspect of the nature of time.",
      "limitedQuantity": ""
    }
  ]
}
